tap "ankitpokhrel/jira-cli"
tap "facebook/fb"
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "sst/tap"
brew "openssl@3"
brew "libgit2"
brew "bat"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "cmake"
brew "direnv"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glib"
brew "pkgconf"
brew "hdf5"
brew "krb5"
brew "libpq"
brew "mas"
brew "node"
brew "python@3.12"
brew "qpdf"
brew "ripgrep"
brew "rust"
brew "starship"
brew "swiftlint"
brew "tcl-tk"
brew "tenv", link: false
brew "terragrunt", link: false
brew "tfenv"
brew "tgenv"
brew "uv"
brew "xcodegen"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "facebook/fb/idb-companion"
cask "1password-cli"
cask "alfred", args: { appdir: "/Applications" }
cask "bartender", args: { appdir: "/Applications" }
cask "claude-code"
cask "discord", args: { appdir: "/Applications" }
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-lato"
cask "font-open-sans", args: { appdir: "/Applications" }
cask "font-roboto", args: { appdir: "/Applications" }
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro", args: { appdir: "/Applications" }
cask "gcloud-cli"
cask "ghostty"
cask "iterm2", args: { appdir: "/Applications" }
cask "moom"
cask "omnifocus", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "steam"
cask "sublime-text"
cask "visual-studio-code"
mas "1Password for Safari", id: 1569813296
mas "Developer", id: 640199958
mas "Fantastical", id: 975937182
mas "Kagi for Safari", id: 1622835804
mas "Keynote", id: 409183694
mas "Numbers", id: 361304891
mas "OmniFocus", id: 1542143627
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
cargo "imessage-exporter"
