# Configure where our applications go
cask_args appdir: '/Applications'

# Taps
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'caskroom/fonts'

# Brews
brew 'stow'
brew 'zsh'
brew 'zsh-completions'
brew 'git'
brew 'git-delta'
brew 'gh'
brew 'libgit2'
brew 'r'
brew 'openssl'
brew 'pkg-config'
brew 'fzf'

cask 'alfred'
cask 'bartender'
cask 'discord'
cask 'docker'
cask 'google-chrome'
cask 'iterm2'
cask 'omnifocus'
cask 'r-studio'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'textexpander'

# Quicklook
cask 'quicklook-csv'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas '1Password', id: 1333542190
mas 'Deliveries', id: 924726344
mas 'Divvy', id: 413857545
mas 'Fantastical 2', id: 975937182
mas 'Keynote', id: 409183694
mas 'LINE', id: 539883307
mas 'Spark', id: 1176895641
