tap "facebook/fb"
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "sst/tap"
brew "mise"
brew "cask"
brew "git"
brew "mas"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "facebook/fb/idb-companion"
cask "1password-cli"
cask "alfred", args: { appdir: "/Applications" }
cask "bartender", args: { appdir: "/Applications" }
cask "claude-code"
cask "discord", args: { appdir: "/Applications" }
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-lato"
cask "font-open-sans", args: { appdir: "/Applications" }
cask "font-roboto", args: { appdir: "/Applications" }
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro", args: { appdir: "/Applications" }
cask "ghostty"
cask "moom"
cask "omnifocus", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "sublime-text"
cask "visual-studio-code"
mas "1Password for Safari", id: 1569813296
mas "Developer", id: 640199958
mas "Fantastical", id: 975937182
mas "Kagi for Safari", id: 1622835804
mas "Keynote", id: 409183694
mas "Numbers", id: 361304891
mas "OmniFocus", id: 1542143627
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
