# Configure where our applications go
cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

# Brews
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'fzf'
brew 'zoxide'
brew 'git'
brew 'git-delta'
brew 'libgit2'
brew 'gh'
brew 'openssl'
brew 'pkg-config'
brew 'pyenv'
brew 'pyenv-virtualenv'

# Casks
cask 'alfred'
cask 'bartender'
cask 'iterm2'
cask 'spotify'
cask 'sublime-text'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'OmniFocus', id: 1542143627
mas '1Password', id: 1333542190
mas 'Moom', id: 419330170
mas 'Fantastical', id: 1569813296
mas 'Gifox', id: 1461845568
mas 'Spark', id: 1176895641
mas 'Bear', id: 1091189122
mas 'Amphetamine', id: 937984704
mas 'Pages', id: 409201541