# Configure where our applications go
cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

# Brews
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'git'
brew 'git-delta'
brew 'gh'
brew 'libgit2'
brew 'openssl'
brew 'pkg-config'
brew 'fzf'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'audio-hijack'
brew 'loopback'

cask 'alfred'
cask 'bartender'
cask 'discord'
cask 'iterm2'
cask 'omnifocus'
cask 'slack'
cask 'spotify'
cask 'sublime-text'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas '1Blocker', id: 1365531024
mas '1Password', id: 1333542190
mas 'Craft', id: 1487937127
mas 'Deliveries', id: 924726344
mas 'Moom', id: 419330170
mas 'Drafts', id: 1435957248
mas 'Encounter+', id: 1170693487
mas 'Fantastical 2', id: 975937182
mas 'Gifox', id: 1461845568
mas 'LINE', id: 539883307
mas 'Spark', id: 1176895641
